// Задача 47. Задайте двумерный массив размером m×n, заполненный случайными 
// вещественными числами.
// m = 3, n = 4.
// 0,5 7 -2 -0,2
// 1 -3,3 8 -9,9
// 8 7,8 -7,1 9

/*
int m = 3;
int n = 4;

double[,] array = new double[m, n];

ArrayDouble(array);
WriteArray(array);
Console.WriteLine();

void ArrayDouble(double[,] array)
{
    for (int i = 0; i < m; i++)
    {
        for (int j = 0; j < n; j++)
        {
            array[i, j] = new Random().NextDouble() * 100;
        }
    }
}

void WriteArray(double[,] array)
{
    for (int i = 0; i < m; i++)
    {
        for (int j = 0; j < n; j++)
        {
            double Number = Math.Round(array[i, j], 1);
            Console.Write(Number + "\t");
        }
        Console.WriteLine();
    }
}
*/

// Задача 50. Напишите программу, которая на вход принимает позиции элемента в 
// двумерном массиве, и возвращает значение этого элемента или же указание, что 
// такого элемента нет.
// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// 17 -> такого числа в массиве нет


int m = 3;
int n = 4;
int[,] array = new int[m, n];

for (int i = 0; i < array.GetLength(0); i++)
{
    for (int j = 0; j < array.GetLength(1); j++)
        array[i, j] = Convert.ToInt32(new Random().Next(30));
}

for (int i = 0; i < array.GetLength(0); i++)
{
    for (int j = 0; j < array.GetLength(1); j++)
        Console.Write(array[i, j] + "\t  ");
    Console.WriteLine();
}

Console.Write("Введите координаты A искомого элемента: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите координаты B искомого элемента: ");
int b = Convert.ToInt32(Console.ReadLine());

if (a > m && b > n)
    Console.WriteLine("Такого числа нет");
else
{
    int result = array[a,b];
    Console.WriteLine($"Значение элемента: {result}");
}


// Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее 
// арифметическое элементов в каждом столбце.
// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// Среднее арифметическое каждого столбца: 4,6; 5,6; 3,6; 3.

/*
int m = 3;
int n = 4;
int[,] array = new int[m, n];

for (int i = 0; i < array.GetLength(0); i++)
{
    for (int j = 0; j < array.GetLength(1); j++)
        array[i, j] = Convert.ToInt32(new Random().Next(30));
}

for (int i = 0; i < array.GetLength(0); i++)
{
    for (int j = 0; j < array.GetLength(1); j++)
        Console.Write(array[i, j] + "\t  ");
    Console.WriteLine();
}

Console.WriteLine($"Cреднее арифметическое:");
for (int i = 0; i < n; i++)
{
  double average = 0;
  for (int j = 0; j < m; j++)
  {
    average += array[j, i];
  }
  average = Math.Round(average / m, 1);
  Console.WriteLine($"столбца № {i+1} {average}");
}
*/
